target/surefire-reports/demo.soap.soap-2.log

11:05:00.526 request:
1 > POST http://127.0.0.1:51918/soap
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 314
1 > Content-Type: application/soap+xml; charset=UTF-8
1 > Host: 127.0.0.1:51918
1 > User-Agent: Apache-HttpClient/4.5.5 (Java/1.8.0_181)
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap12:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>2</intA>
      <intB>3</intB>
    </Add>
  </soap12:Body>
</soap12:Envelope>

11:05:00.543 response time in milliseconds: 11.41
1 < 200
1 < Cache-Control: no-cache, no-store, max-age=0, must-revalidate
1 < Content-Length: 325
1 < Content-Type: text/plain;charset=UTF-8
1 < Date: Tue, 09 Apr 2019 14:05:00 GMT
1 < Expires: 0
1 < Pragma: no-cache
1 < X-Content-Type-Options: nosniff
1 < X-Frame-Options: DENY
1 < X-XSS-Protection: 1; mode=block
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AddResponse xmlns="http://tempuri.org/"><AddResult>5</AddResult></AddResponse></soap:Body></soap:Envelope>

